blog-posts/2006-06-03-blackberries-and-such.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Blackberries and such</title>
<!-- 2015-10-19 Mon 14:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Blackberries and such</h1>
<p>
June 3rd, 2006 -
<a href="http://sachachua.com/blog/p/3572"><a href="http://sachachua.com/blog/p/3572">http://sachachua.com/blog/p/3572</a></a>
</p>

<p>
<a href="http://mysite.verizon.net/johnsu01/">John Sullivan</a> said:
</p>

<blockquote>
<p>
You've really got to get a comment system working on your blog :)
</p>

<p>
There are a lot of new interesting devices that are better and less
locked down than the Blackberry. I'm writing this email from one right
now, a Nokia E61. It has wifi and can make SIP calls in addition to
regular phone calls! Also, it runs Python. It's expensive, but only
about the same as a new new Blackberry.
</p>

<p>
I've just yesterday started a backpack page about my working with it,
at
<a href="http://johnsu01.backpackit.com/pub/613005"><a href="http://johnsu01.backpackit.com/pub/613005">http://johnsu01.backpackit.com/pub/613005</a></a>.
</p>

<p>
Nokia also appears to be heading rapidly down the FLOSS path, and I
\<sub>know\</sub>_ you'll be wanting to hack your device. :)
</p>
</blockquote>

<p>
Well, if someone wants to hack together Planner + a nice non-spammy
comment system, I'd love to test it. I used to use blogKomm, but I
needed to modify it at some point and the code was in German. Not quite
fu.
</p>

<p>
Ooooh, wifi is good.
</p>

<p>
I've been doing okay with my laptop so far. It's actually more
 portable than I thought. Might try the Vaio for even more fun and
 profit. =) And yes, I'd rather have a hackable device than something
 that Just Works for everyone but me&#x2026; ;)
</p>

<p>
Random Japanese sentence:
ÃƒÂ£Ã‚Â?Ã‚ÂŠÃƒÂ£Ã‚Â?Ã‚Â°ÃƒÂ£Ã‚Â?Ã‚Â‚ÃƒÂ£Ã‚Â?Ã‚Â•ÃƒÂ£Ã‚Â‚Ã‚Â“ÃƒÂ£Ã‚Â?Ã‚Â¯ÃƒÂ£Ã‚Â€Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â?Ã‚Â°ÃƒÂ£Ã‚Â‚Ã‚Â‰ÃƒÂ£Ã‚Â?Ã‚Â?ÃƒÂ¨Ã‚Â€Ã‚ÂƒÃƒÂ£Ã‚Â?Ã‚ÂˆÃƒÂ£Ã‚Â?Ã‚Â¾ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â?Ã‚ÂŸÃƒÂ£Ã‚Â€Ã‚Â‚ÃƒÂ£Ã‚Â?Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â?Ã‚Â¦ÃƒÂ¨Ã‚Â¨Ã‚Â€ÃƒÂ£Ã‚Â?Ã‚Â„ÃƒÂ£Ã‚Â?Ã‚Â¾ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â?Ã‚ÂŸÃƒÂ£Ã‚Â€Ã‚Â‚ÃƒÂ£Ã‚Â€Ã‚ÂŒÃƒÂ£Ã‚Â‚Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â‹ÃƒÂ£Ã‚Â‚Ã‚ÂŠÃƒÂ£Ã‚Â?Ã‚Â¾ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â?Ã‚ÂŸÃƒÂ£Ã‚Â‚Ã‚ÂˆÃƒÂ¯Ã‚Â¼Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â©ÃƒÂ£Ã‚Â?Ã‚Â®ÃƒÂ£Ã‚Â?Ã‚Â­ÃƒÂ£Ã‚Â?Ã‚Â“ÃƒÂ£Ã‚Â‚Ã‚Â'ÃƒÂ£Ã‚Â?Ã‚Â†ÃƒÂ£Ã‚Â?Ã‚Â¡ÃƒÂ£Ã‚Â?Ã‚Â«ÃƒÂ£Ã‚Â?Ã‚ÂŠÃƒÂ£Ã‚Â?Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â‹ÃƒÂ£Ã‚Â€Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â­ÃƒÂ£Ã‚Â?Ã‚Â“ÃƒÂ£Ã‚Â?Ã‚ÂŸÃƒÂ£Ã‚Â?Ã‚Â¡ÃƒÂ£Ã‚Â?Ã‚Â«ÃƒÂ¦Ã‚Â±Ã‚ÂºÃƒÂ£Ã‚Â‚Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â•ÃƒÂ£Ã‚Â?Ã‚Â›ÃƒÂ£Ã‚Â?Ã‚Â¾ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â‚Ã‚Â‡ÃƒÂ£Ã‚Â?Ã‚Â†ÃƒÂ£Ã‚Â€Ã‚Â?
The very old woman thought for a while and then she said, I know! We
will let the cats decide which one we should keep.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
